cmsis-svd/cmsis-svd/data/Infineon/s6e2g3xj.svd
        <!-- REGISTER "EIRR" -->
        <register>
          <name>EIRR</name>
          <description>External Interrupt Request Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ER31" -->
            <field>
              <name>ER31</name>
              <description>Bit31 of EIRR</description>
              <msb>31</msb>
              <lsb>31</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ER30" -->
            <field>
              <name>ER30</name>
              <description>Bit30 of EIRR</description>
              <msb>30</msb>
              <lsb>30</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ER29" -->
            <field>
              <name>ER29</name>
              <description>Bit29 of EIRR</description>
              <msb>29</msb>
              <lsb>29</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ER28" -->
            <field>
              <name>ER28</name>
              <description>Bit28 of EIRR</description>
              <msb>28</msb>
              <lsb>28</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ER27" -->
            <field>
              <name>ER27</name>
              <description>Bit27 of EIRR</description>
              <msb>27</msb>
              <lsb>27</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ER26" -->
            <field>
              <name>ER26</name>
              <description>Bit26 of EIRR</description>
              <msb>26</msb>
              <lsb>26</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ER25" -->
            <field>
              <name>ER25</name>
              <description>Bit25 of EIRR</description>
              <msb>25</msb>
              <lsb>25</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ER24" -->
            <field>
              <name>ER24</name>
              <description>Bit24 of EIRR</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ER23" -->
            <field>
              <name>ER23</name>
              <description>Bit23 of EIRR</description>
              <msb>23</msb>
              <lsb>23</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ER22" -->
            <field>
              <name>ER22</name>
              <description>Bit22 of EIRR</description>
              <msb>22</msb>
              <lsb>22</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ER21" -->
            <field>
              <name>ER21</name>
              <description>Bit21 of EIRR</description>
              <msb>21</msb>
              <lsb>21</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ER20" -->
            <field>
              <name>ER20</name>
              <description>Bit20 of EIRR</description>
              <msb>20</msb>
              <lsb>20</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ER19" -->
            <field>
              <name>ER19</name>
              <description>Bit19 of EIRR</description>
              <msb>19</msb>
              <lsb>19</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ER18" -->
            <field>
              <name>ER18</name>
              <description>Bit18 of EIRR</description>
              <msb>18</msb>
              <lsb>18</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ER17" -->
            <field>
              <name>ER17</name>
              <description>Bit17 of EIRR</description>
              <msb>17</msb>
              <lsb>17</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ER16" -->
            <field>
              <name>ER16</name>
              <description>Bit16 of EIRR</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ER15" -->
            <field>
              <name>ER15</name>
              <description>Bit15 of EIRR</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ER14" -->
            <field>
              <name>ER14</name>
              <description>Bit14 of EIRR</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ER13" -->
            <field>
              <name>ER13</name>
              <description>Bit13 of EIRR</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ER12" -->
            <field>
              <name>ER12</name>
              <description>Bit12 of EIRR</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ER11" -->
            <field>
              <name>ER11</name>
              <description>Bit11 of EIRR</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ER10" -->
            <field>
              <name>ER10</name>
              <description>Bit10 of EIRR</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ER9" -->
            <field>
              <name>ER9</name>
              <description>Bit9 of EIRR</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ER8" -->
            <field>
              <name>ER8</name>
              <description>Bit8 of EIRR</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ER7" -->
            <field>
              <name>ER7</name>
              <description>Bit7 of EIRR</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ER6" -->
            <field>
              <name>ER6</name>
              <description>Bit6 of EIRR</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ER5" -->
            <field>
              <name>ER5</name>
              <description>Bit5 of EIRR</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ER4" -->
            <field>
              <name>ER4</name>
              <description>Bit4 of EIRR</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ER3" -->
            <field>
              <name>ER3</name>
              <description>Bit3 of EIRR</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ER2" -->
            <field>
              <name>ER2</name>
              <description>Bit2 of EIRR</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ER1" -->
            <field>
              <name>ER1</name>
              <description>Bit1 of EIRR</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ER0" -->
            <field>
              <name>ER0</name>
              <description>Bit0 of EIRR</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EICL" -->
        <register>
          <name>EICL</name>
          <description>External Interrupt Clear Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ECL31" -->
            <field>
              <name>ECL31</name>
              <description>Bit31 of EICL</description>
              <msb>31</msb>
              <lsb>31</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL30" -->
            <field>
              <name>ECL30</name>
              <description>Bit30 of EICL</description>
              <msb>30</msb>
              <lsb>30</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL29" -->
            <field>
              <name>ECL29</name>
              <description>Bit29 of EICL</description>
              <msb>29</msb>
              <lsb>29</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL28" -->
            <field>
              <name>ECL28</name>
              <description>Bit28 of EICL</description>
              <msb>28</msb>
              <lsb>28</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL27" -->
            <field>
              <name>ECL27</name>
              <description>Bit27 of EICL</description>
              <msb>27</msb>
              <lsb>27</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL26" -->
            <field>
              <name>ECL26</name>
              <description>Bit26 of EICL</description>
              <msb>26</msb>
              <lsb>26</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL25" -->
            <field>
              <name>ECL25</name>
              <description>Bit25 of EICL</description>
              <msb>25</msb>
              <lsb>25</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL24" -->
            <field>
              <name>ECL24</name>
              <description>Bit24 of EICL</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL23" -->
            <field>
              <name>ECL23</name>
              <description>Bit23 of EICL</description>
              <msb>23</msb>
              <lsb>23</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL22" -->
            <field>
              <name>ECL22</name>
              <description>Bit22 of EICL</description>
              <msb>22</msb>
              <lsb>22</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL21" -->
            <field>
              <name>ECL21</name>
              <description>Bit21 of EICL</description>
              <msb>21</msb>
              <lsb>21</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL20" -->
            <field>
              <name>ECL20</name>
              <description>Bit20 of EICL</description>
              <msb>20</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL19" -->
            <field>
              <name>ECL19</name>
              <description>Bit19 of EICL</description>
              <msb>19</msb>
              <lsb>19</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL18" -->
            <field>
              <name>ECL18</name>
              <description>Bit18 of EICL</description>
              <msb>18</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL17" -->
            <field>
              <name>ECL17</name>
              <description>Bit17 of EICL</description>
              <msb>17</msb>
              <lsb>17</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL16" -->
            <field>
              <name>ECL16</name>
              <description>Bit16 of EICL</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL15" -->
            <field>
              <name>ECL15</name>
              <description>Bit15 of EICL</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL14" -->
            <field>
              <name>ECL14</name>
              <description>Bit14 of EICL</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL13" -->
            <field>
              <name>ECL13</name>
              <description>Bit13 of EICL</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL12" -->
            <field>
              <name>ECL12</name>
              <description>Bit12 of EICL</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL11" -->
            <field>
              <name>ECL11</name>
              <description>Bit11 of EICL</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL10" -->
            <field>
              <name>ECL10</name>
              <description>Bit10 of EICL</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL9" -->
            <field>
              <name>ECL9</name>
              <description>Bit9 of EICL</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL8" -->
            <field>
              <name>ECL8</name>
              <description>Bit8 of EICL</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL7" -->
            <field>
              <name>ECL7</name>
              <description>Bit7 of EICL</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL6" -->
            <field>
              <name>ECL6</name>
              <description>Bit6 of EICL</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL5" -->
            <field>
              <name>ECL5</name>
              <description>Bit5 of EICL</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL4" -->
            <field>
              <name>ECL4</name>
              <description>Bit4 of EICL</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL3" -->
            <field>
              <name>ECL3</name>
              <description>Bit3 of EICL</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL2" -->
            <field>
              <name>ECL2</name>
              <description>Bit2 of EICL</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL1" -->
            <field>
              <name>ECL1</name>
              <description>Bit1 of EICL</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL0" -->
            <field>
              <name>ECL0</name>
              <description>Bit0 of EICL</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
