cmsis-svd/cmsis-svd/data/Infineon/s6e2g3xj.svd
      </registers>
    </peripheral>
    <!-- PERIPHERAL "SMCIF0" -->
    <peripheral>
      <name>SMCIF0</name>
      <description>Smart Card Interface 0 Registers</description>
      <version>A</version>
      <groupName>SMCIF</groupName>
      <baseAddress>0x4003C900</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x8</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xC</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x14</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x18</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1C</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x20</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x24</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x28</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2C</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x30</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x34</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x38</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x3C</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x40</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- INTERRUPT "ICC0_1" -->
      <interrupt>
        <name>ICC0_1</name>
        <value>117</value>
      </interrupt>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "GLOBALCONTROL1" -->
        <register>
          <name>GLOBALCONTROL1</name>
          <description>Global Control Register 1</description>
          <addressOffset>0x0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0800</resetValue>
          <resetMask>0x7FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "IDTSC" -->
            <field>
              <name>IDTSC</name>
              <description>Idle timer clock select bit</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STIDT" -->
            <field>
              <name>STIDT</name>
              <description>Start idle timer bit</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "GUAEN" -->
            <field>
              <name>GUAEN</name>
              <description>Guard timer enable bit</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RESND" -->
            <field>
              <name>RESND</name>
              <description>Transmiter and receiver resend function enable bit</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CKMOD" -->
            <field>
              <name>CKMOD</name>
              <description>Clock generation mode select bit</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "IOMOD" -->
            <field>
              <name>IOMOD</name>
              <description>Data generation mode select bit</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MASKITEXP" -->
            <field>
              <name>MASKITEXP</name>
              <description>Idle timer expired interrupt enable bit</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MASKCAEVENT" -->
            <field>
              <name>MASKCAEVENT</name>
              <description>Card event detect interrupt enable bit</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MASKSTI" -->
            <field>
              <name>MASKSTI</name>
              <description>Start bit detect interrupt enable bit</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MASKTXEMP" -->
            <field>
              <name>MASKTXEMP</name>
              <description>Transmit data register empty interrupt enable bit</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MASKRXFUL" -->
            <field>
              <name>MASKRXFUL</name>
              <description>Receive data register full interrupt enable bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MODE8N1" -->
            <field>
              <name>MODE8N1</name>
              <description>Clock generation mode select bit</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FRM1" -->
            <field>
              <name>FRM1</name>
              <description>Data frame coding style select bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FRM0" -->
            <field>
              <name>FRM0</name>
              <description>Clock generation mode select bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PARITY" -->
            <field>
              <name>PARITY</name>
              <description>Odd/Even parity select bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "STATUS" -->
        <register>
          <name>STATUS</name>
          <description>Status Register</description>
          <addressOffset>0x4</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0001</resetValue>
          <resetMask>0x3FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RXRESEND" -->
            <field>
              <name>RXRESEND</name>
              <description>Receiver resend flag bit</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TXRESEND" -->
            <field>
              <name>TXRESEND</name>
              <description>Transmitter resend flag bit</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RXSTARTERR" -->
            <field>
              <name>RXSTARTERR</name>
              <description>Received start bit error flag bit</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WRFIFOEMP" -->
            <field>
              <name>WRFIFOEMP</name>
              <description>Write FIFO empty flag bit</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RDFIFOFUL" -->
            <field>
              <name>RDFIFOFUL</name>
              <description>Read FIFO full flag bit</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RDFIFOOVR" -->
            <field>
              <name>RDFIFOOVR</name>
              <description>Read FIFO overflow flag</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IDTRUN" -->
            <field>
              <name>IDTRUN</name>
              <description>Idle timer running flag</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RECOFL" -->
            <field>
              <name>RECOFL</name>
              <description>Received data register overflow flag</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CARDEVENT" -->
            <field>
              <name>CARDEVENT</name>
              <description>Card event flag</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CARDDETECT" -->
            <field>
              <name>CARDDETECT</name>
              <description>Level on ICx_CIN input pin</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TXACT" -->
            <field>
              <name>TXACT</name>
              <description>Transmitter status flag</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RXACT" -->
            <field>
              <name>RXACT</name>
              <description>Receiver status flag</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RXFUL" -->
            <field>
              <name>RXFUL</name>
              <description>Received data register status flag</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TXEMP" -->
            <field>
              <name>TXEMP</name>
              <description>Transmit data register status flag</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PORTCONTROL" -->
        <register>
          <name>PORTCONTROL</name>
          <description>Port Control Register</description>
          <addressOffset>0x8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xF3D5</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "VPENOUTEN" -->
            <field>
              <name>VPENOUTEN</name>
              <description>ICx_VPEN output enable bit</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VCCOUTEN" -->
            <field>
              <name>VCCOUTEN</name>
              <description>ICx_VCC output enable bit</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RSTOUTEN" -->
            <field>
              <name>RSTOUTEN</name>
              <description>ICx_RST output enable bit</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CLKOUTEN" -->
            <field>
              <name>CLKOUTEN</name>
              <description>ICx_CLK output enable bit</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VPEN" -->
            <field>
              <name>VPEN</name>
              <description>ICx_VPEN output value</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VCCEN" -->
            <field>
              <name>VCCEN</name>
              <description>ICx_VCC output value</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RST" -->
            <field>
              <name>RST</name>
              <description>ICx_RST output value</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CLKPT" -->
            <field>
              <name>CLKPT</name>
              <description>ICx_CLK output value</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "IO1EN" -->
            <field>
              <name>IO1EN</name>
              <description>ICx_DATA output enable control bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "IO1" -->
            <field>
              <name>IO1</name>
              <description>Level on ICx_DATA pin</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TRIMOD" -->
            <field>
              <name>TRIMOD</name>
              <description>ICx_DATA output enable generation mode select bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "DATA" -->
        <register>
          <name>DATA</name>
          <description>Data Register</description>
          <addressOffset>0xC</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x01FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DATA" -->
            <field>
              <name>DATA</name>
              <description>Transmit/Received data</description>
              <msb>8</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CARDCLOCK" -->
        <register>
          <name>CARDCLOCK</name>
          <description>Card Clock Frequency Register</description>
          <addressOffset>0x10</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CLKDIVIDER" -->
            <field>
              <name>CLKDIVIDER</name>
              <description>Card clock frequency divider</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
