cmsis-svd/cmsis-svd/data/Infineon/s6e2g3xj.svd
        <!-- REGISTER "DREQENB0" -->
        <register>
          <name>DREQENB0</name>
          <description>DMA request enable Register 0</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "DREQENB1" -->
        <register derivedFrom="DREQENB0">
          <name>DREQENB1</name>
          <description>DMA request enable Register 1</description>
          <addressOffset>0x14</addressOffset>
        </register>
        <!-- REGISTER "DREQENB2" -->
        <register derivedFrom="DREQENB0">
          <name>DREQENB2</name>
          <description>DMA request enable Register 2</description>
          <addressOffset>0x18</addressOffset>
        </register>
        <!-- REGISTER "DREQENB3" -->
        <register derivedFrom="DREQENB0">
          <name>DREQENB3</name>
          <description>DMA request enable Register 3</description>
          <addressOffset>0x1C</addressOffset>
        </register>
        <!-- REGISTER "DREQENB4" -->
        <register derivedFrom="DREQENB0">
          <name>DREQENB4</name>
          <description>DMA request enable Register 4</description>
          <addressOffset>0x20</addressOffset>
        </register>
        <!-- REGISTER "DREQENB5" -->
        <register derivedFrom="DREQENB0">
          <name>DREQENB5</name>
          <description>DMA request enable Register 5</description>
          <addressOffset>0x24</addressOffset>
        </register>
        <!-- REGISTER "DREQENB6" -->
        <register derivedFrom="DREQENB0">
          <name>DREQENB6</name>
          <description>DMA request enable Register 6</description>
          <addressOffset>0x28</addressOffset>
        </register>
        <!-- REGISTER "DREQENB7" -->
        <register derivedFrom="DREQENB0">
          <name>DREQENB7</name>
          <description>DMA request enable Register 7</description>
          <addressOffset>0x2C</addressOffset>
        </register>
        <!-- REGISTER "HWINT0" -->
        <register>
          <name>HWINT0</name>
          <description>Hardware transfer interrupt Register 0</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "HWINT1" -->
        <register derivedFrom="HWINT0">
          <name>HWINT1</name>
          <description>Hardware transfer interrupt Register 1</description>
          <addressOffset>0x34</addressOffset>
        </register>
        <!-- REGISTER "HWINT2" -->
        <register derivedFrom="HWINT0">
          <name>HWINT2</name>
          <description>Hardware transfer interrupt Register 2</description>
          <addressOffset>0x38</addressOffset>
        </register>
        <!-- REGISTER "HWINT3" -->
        <register derivedFrom="HWINT0">
          <name>HWINT3</name>
          <description>Hardware transfer interrupt Register 3</description>
          <addressOffset>0x3C</addressOffset>
        </register>
        <!-- REGISTER "HWINT4" -->
        <register derivedFrom="HWINT0">
          <name>HWINT4</name>
          <description>Hardware transfer interrupt Register 4</description>
          <addressOffset>0x40</addressOffset>
        </register>
        <!-- REGISTER "HWINT5" -->
        <register derivedFrom="HWINT0">
          <name>HWINT5</name>
          <description>Hardware transfer interrupt Register 5</description>
          <addressOffset>0x44</addressOffset>
        </register>
        <!-- REGISTER "HWINT6" -->
        <register derivedFrom="HWINT0">
          <name>HWINT6</name>
          <description>Hardware transfer interrupt Register 6</description>
          <addressOffset>0x48</addressOffset>
        </register>
        <!-- REGISTER "HWINT7" -->
        <register derivedFrom="HWINT0">
          <name>HWINT7</name>
          <description>Hardware transfer interrupt Register 7</description>
          <addressOffset>0x4C</addressOffset>
        </register>
        <!-- REGISTER "HWINTCLR0" -->
        <register>
          <name>HWINTCLR0</name>
          <description>Hardware transfer interrupt clear Register 0</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "HWINTCLR1" -->
        <register derivedFrom="HWINTCLR0">
          <name>HWINTCLR1</name>
          <description>Hardware transfer interrupt clear Register 1</description>
          <addressOffset>0x54</addressOffset>
        </register>
        <!-- REGISTER "HWINTCLR2" -->
        <register derivedFrom="HWINTCLR0">
          <name>HWINTCLR2</name>
          <description>Hardware transfer interrupt clear Register 2</description>
          <addressOffset>0x58</addressOffset>
        </register>
        <!-- REGISTER "HWINTCLR3" -->
        <register derivedFrom="HWINTCLR0">
          <name>HWINTCLR3</name>
          <description>Hardware transfer interrupt clear Register 3</description>
          <addressOffset>0x5C</addressOffset>
        </register>
        <!-- REGISTER "HWINTCLR4" -->
        <register derivedFrom="HWINTCLR0">
          <name>HWINTCLR4</name>
          <description>Hardware transfer interrupt clear Register 4</description>
          <addressOffset>0x60</addressOffset>
        </register>
        <!-- REGISTER "HWINTCLR5" -->
        <register derivedFrom="HWINTCLR0">
          <name>HWINTCLR5</name>
          <description>Hardware transfer interrupt clear Register 5</description>
          <addressOffset>0x64</addressOffset>
        </register>
        <!-- REGISTER "HWINTCLR6" -->
        <register derivedFrom="HWINTCLR0">
          <name>HWINTCLR6</name>
          <description>Hardware transfer interrupt clear Register 6</description>
          <addressOffset>0x68</addressOffset>
        </register>
