cmsis-svd/cmsis-svd/data/Infineon/s6e2g3xj.svd
        <!-- REGISTER "PDORF" -->
        <register>
          <name>PDORF</name>
          <description>Port Output Data Register F</description>
          <addressOffset>0x43C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P7" -->
            <field>
              <name>P7</name>
              <description>Bit7 of PDORF</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P6" -->
            <field>
              <name>P6</name>
              <description>Bit6 of PDORF</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P5" -->
            <field>
              <name>P5</name>
              <description>Bit5 of PDORF</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P4" -->
            <field>
              <name>P4</name>
              <description>Bit4 of PDORF</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P3" -->
            <field>
              <name>P3</name>
              <description>Bit3 of PDORF</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P2" -->
            <field>
              <name>P2</name>
              <description>Bit2 of PDORF</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P1" -->
            <field>
              <name>P1</name>
              <description>Bit1 of PDORF</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P0" -->
            <field>
              <name>P0</name>
              <description>Bit0 of PDORF</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ADE" -->
        <register>
          <name>ADE</name>
          <description>Analog Input Setting Register</description>
          <addressOffset>0x500</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "AN31" -->
            <field>
              <name>AN31</name>
              <description>Analog Input Ch.31 Setting Register</description>
              <msb>31</msb>
              <lsb>31</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN30" -->
            <field>
              <name>AN30</name>
              <description>Analog Input Ch.30 Setting Register</description>
              <msb>30</msb>
              <lsb>30</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN29" -->
            <field>
              <name>AN29</name>
              <description>Analog Input Ch.29 Setting Register</description>
              <msb>29</msb>
              <lsb>29</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN28" -->
            <field>
              <name>AN28</name>
              <description>Analog Input Ch.28 Setting Register</description>
              <msb>28</msb>
              <lsb>28</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN27" -->
            <field>
              <name>AN27</name>
              <description>Analog Input Ch.27 Setting Register</description>
              <msb>27</msb>
              <lsb>27</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN26" -->
            <field>
              <name>AN26</name>
              <description>Analog Input Ch.26 Setting Register</description>
              <msb>26</msb>
              <lsb>26</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN25" -->
            <field>
              <name>AN25</name>
              <description>Analog Input Ch.25 Setting Register</description>
              <msb>25</msb>
              <lsb>25</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN24" -->
            <field>
              <name>AN24</name>
              <description>Analog Input Ch.24 Setting Register</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN23" -->
            <field>
              <name>AN23</name>
              <description>Analog Input Ch.23 Setting Register</description>
              <msb>23</msb>
              <lsb>23</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN22" -->
            <field>
              <name>AN22</name>
              <description>Analog Input Ch.22 Setting Register</description>
              <msb>22</msb>
              <lsb>22</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN21" -->
            <field>
              <name>AN21</name>
              <description>Analog Input Ch.21 Setting Register</description>
              <msb>21</msb>
              <lsb>21</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN20" -->
            <field>
              <name>AN20</name>
              <description>Analog Input Ch.20 Setting Register</description>
              <msb>20</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN19" -->
            <field>
              <name>AN19</name>
              <description>Analog Input Ch.19 Setting Register</description>
              <msb>19</msb>
              <lsb>19</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN18" -->
            <field>
              <name>AN18</name>
              <description>Analog Input Ch.18 Setting Register</description>
              <msb>18</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN17" -->
            <field>
              <name>AN17</name>
              <description>Analog Input Ch.17 Setting Register</description>
              <msb>17</msb>
              <lsb>17</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN16" -->
            <field>
              <name>AN16</name>
              <description>Analog Input Ch.16 Setting Register</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN15" -->
            <field>
              <name>AN15</name>
              <description>Analog Input Ch.15 Setting Register</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN14" -->
            <field>
              <name>AN14</name>
              <description>Analog Input Ch.14 Setting Register</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN13" -->
            <field>
              <name>AN13</name>
              <description>Analog Input Ch.13 Setting Register</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN12" -->
            <field>
              <name>AN12</name>
              <description>Analog Input Ch.12 Setting Register</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN11" -->
            <field>
              <name>AN11</name>
              <description>Analog Input Ch.11 Setting Register</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN10" -->
            <field>
              <name>AN10</name>
              <description>Analog Input Ch.10 Setting Register</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN09" -->
            <field>
              <name>AN09</name>
              <description>Analog Input Ch.9 Setting Register</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN08" -->
            <field>
              <name>AN08</name>
              <description>Analog Input Ch.8 Setting Register</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN07" -->
            <field>
              <name>AN07</name>
              <description>Analog Input Ch.7 Setting Register</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN06" -->
            <field>
              <name>AN06</name>
              <description>Analog Input Ch.6 Setting Register</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN05" -->
            <field>
              <name>AN05</name>
              <description>Analog Input Ch.5 Setting Register</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN04" -->
            <field>
              <name>AN04</name>
              <description>Analog Input Ch.4 Setting Register</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN03" -->
            <field>
              <name>AN03</name>
              <description>Analog Input Ch.3 Setting Register</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN02" -->
            <field>
              <name>AN02</name>
              <description>Analog Input Ch.2 Setting Register</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN01" -->
            <field>
              <name>AN01</name>
              <description>Analog Input Ch.1 Setting Register</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN00" -->
            <field>
              <name>AN00</name>
              <description>Analog Input Ch.0 Setting Register</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
